# Homework 5: Data Aggregation and Cleaning
## ECE204 Data Science & Engineering

### Please refer to Homework 5 in Canvas for the prompts for each question

In [1]:
import pandas as pd

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

---
**Problem 1.**

In [2]:
# given code
df_cars = pd.read_csv("cars.csv")
df_cars.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01

In [3]:
# your code here
df1 = df_cars.dropna(subset=["Horsepower", "Miles_per_Gallon"])
df1["Displacement"].mean()

194.41198979591837

---
**Problem 2.**

In [4]:
# given code
df_cars = pd.read_csv("cars.csv")
df_cars.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01

In [8]:
# your code here
df2 = df_cars[df_cars["Origin"] == "USA"]
df3 = df_cars[df_cars["Origin"] == "Europe"]
df4 = df_cars[df_cars["Origin"] == "Japan"]
df2["Miles_per_Gallon"].max()
df3["Miles_per_Gallon"].max()
df4["Miles_per_Gallon"].max()

46.6

---
**Problem 3.**

In [16]:
# given code
df_cars = pd.read_csv("cars.csv")

In [9]:
# your code here

df2 = df_cars[df_cars["Origin"] == "USA"]
df3 = df_cars[df_cars["Origin"] == "Europe"]
df4 = df_cars[df_cars["Origin"] == "Japan"]
df2["Miles_per_Gallon"].idxmax()
df3["Miles_per_Gallon"].idxmax()
df4["Miles_per_Gallon"].idxmax()

(df2.loc[351]["Weight_in_lbs"] + df3.loc[332]["Weight_in_lbs"] + df4.loc[329]["Weight_in_lbs"] ) /3

2023.3333333333333

---
**Problem 4.**

In [31]:
# given code
df_cars = pd.read_csv("cars.csv")
df_cars.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970-01-01
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970-01-01
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970-01-01
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970-01-01
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970-01-01

In [12]:
# your code here
grouped = df_cars.groupby('Cylinders')
max_lengths = grouped['Name'].apply(lambda x: x.str.len().max())
top_5_max_lengths = max_lengths.nlargest(5)
top_5_max_lengths.mean()

26.8

---
**Problem 5.**

In [14]:
# given code
import numpy as np

In [21]:
# your code here
import numpy as np


random_numbers = np.random.normal(loc=0.85, scale=2.13, size=100000)
count_greater_than_067 = np.sum(random_numbers > 0.67)
count_greater_than_067 / num_samples

0.53311

---
**Problem 6.**

In [25]:
# given code
df_cars_unclean = pd.read_csv("cars_unclean.csv")
df_cars_unclean.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,14.5,4.0,90.0,75.0,28.0,dodge colt,USA,2125,1/1/1974
1,22.1,NaN,NaN,60.0,24.5,NaN,USA,2164,NaN
2,17.0,6.0,262.0,85.0,38.0,oldsmobile cutlass ciera (diesel),USA,3015,1/1/1982
3,16.4,4.0,86.0,65.0,37.2,datsun 310,Japan,2019,1/1/1980
4,14.5,4.0,156.0,92.0,26.0,chrysler lebaron medallion,USA,2585,1/1/1982

In [29]:
# your code here
df5 = df_cars_unclean[['Acceleration', 'Cylinders', 'Displacement', 'Horsepower', 'Miles_per_Gallon', 'Weight_in_lbs']]
df6 = df5.dropna()
df6["Acceleration"].mean()

15.548010610079576

---
**Problem 7.**

In [33]:
df_airports = pd.read_csv("airports_unclean.csv")
df_airports.head()

,iata,name,city,state,country,latitude,longitude
0,X67,Christiansted Harbor Seaplane Base,Christiansted,VI,USA,17.747195,-64.704864
1,STX,Henry E. Rohlsen,Christiansted,VI,USA,17.701889,-64.798556
2,X96,Cruz Bay Harbor Seaplane Base,Cruz Bay,VI,USA,18.336898,-64.799583
3,X66,Charlotte Amalie Harbor Seaplane Base,Charlotte Amalie,VI,USA,18.338567,-64.940701
4,STT,Cyril E. King,Charlotte Amalie,VI,USA,18.337306,-64.973361

In [39]:
# your code here
df7 = df_airports.dropna(subset=['state'])
df8 = df7[df7['state'].str.lower().str.startswith('wi')]
df8['latitude'].min()

42.5957075

---
**Problem 8.**

In [40]:
# given code
df_flights = pd.read_csv("flights_unclean.csv")
df_flights.head()

              date  delay destination  distance  Distance origin
0   2/3/2001 20:50     -2         RDU     443.0       NaN    BNA
1   2/7/2001 21:45     -1         LAS       NaN     223.0    BUR
2  2/10/2001 12:10     -6         LAS       NaN    1235.0    HOU
3  1/25/2001 11:50      8         MSY       NaN     487.0    TPA
4   2/1/2001 08:00     -8         LAX       NaN     337.0    OAK

In [41]:
# your code here
df_flights['Distance'] = df_flights['Distance'].fillna(df_flights['distance'])
df_flights['Distance'].mean()

501.3433

---